//==================================================================================
// Функции, выбирающие и вставляющие значение на основании названия параметра
// и имени таблицы возрастных диапазонов
//==================================================================================
// Референсные интервалы
function fillReferenceInterval (parameterName, ageRangeTable) {
  let referenceTable = 'table_' + parameterName + '_' + genderSelected;
  let referenceTableIndex = getAgeGroup(ageRangeTable);
  let targetCell = '#reference-' + parameterName;
  let referenceInterval = window[referenceTable][referenceTableIndex];
  $(targetCell).val(referenceInterval);
};

function getAgeGroup (ageRangeTable) {
  let index;
  for (index = 0; index < ageRangeTable.length - 1; index++) {
    if (rangeShort(ageConverted, ageRangeTable[index], ageRangeTable[index + 1])) {
      return index;
    } else {
    };
  };
};

function getPercentile (patientParameterValue, parameterValuesArray, categoryName) {
  // передаем сюда ИНДЕКС под-массива значений, уже вычисленный на основе возрастного интервала
  // передаем сюда ЗНАЧЕНИЕ показателя реального пациента
  let index;
  let percentilesTableName = ('percentiles' + categoryName);
  for (index = 0; index < parameterValuesArray.length - 1; index++) {
    if (rangeShort(patientParameterValue, parameterValuesArray[index], parameterValuesArray[index + 1])) {
      return window[percentilesTableName][index];
    } else {
    };
  };
};

// Процентили
function fillPercentile (parameterName, categoryName) {
  let patientParameterValue = $('#patient-' + parameterName).val();

  let parametersTable = 'table_' + parameterName + '_' + genderSelected;
  console.log('Parameters Table: ' + parametersTable);

  let ageRangeForCategory = 'ageRangeTable' + categoryName;
  let parametersTableIndex = getAgeGroup(window[ageRangeForCategory]);
  console.log('Parameters Table Index: ' + parametersTableIndex);

  let parameterValuesArray = window[parametersTable][parametersTableIndex];
  console.log('Parameter Values Array: ' + parameterValuesArray);

  let percentileInterval = getPercentile(patientParameterValue, parameterValuesArray, categoryName);
  console.log('percentileInterval: ' + percentileInterval);

  $('#percentile-' + parameterName).val(percentileInterval);
};

//==================================================================================
// Age group and tables for Reference values: Height, Weight
//==================================================================================
// 39 возр.групп, относится к таблицам: Рост, Вес
var ageRangeTableHeight = [
  0,
  1,2,3,4,5,
  6,7,8,9,10,
  11,12,15,18,21,
  24,27,30,33,36,
  42,48,54,60,66,
  72,78,84,96,108,
  120,132,144,156,168,
  180,192,204,240
];

// Рост (см), Мальчики
var table_height_male = [
  '50,0 - 53,2 см',
  '52,8 - 56,3 см',
  '55,8 - 59,5 см',
  '58,6 - 62,4 см',
  '61,3 - 65,6 см',
  '63,4 - 67,9 см',
  '65,6 - 69,9 см',
  '67,5 - 71,4 см',
  '68,9 - 73,0 см',
  '70,1 - 74,5 см',
  '71,3 - 76,1 см',
  '72,6 - 77,3 см',
  '73,8 - 78,5 см',
  '76,0 - 81,3 см',
  '78,4 - 84,4 см',
  '80,8 - 86,8 см',
  '83,0 - 88,4 см',
  '85,5 - 92,2 см',
  '87,5 - 94,8 см',
  '90,0 - 97,4 см',
  '92,1 - 99,7 см',
  '95,0 - 102,5 см',
  '98,3 - 105,5 см',
  '101,2 - 108,5 см',
  '105,9 - 112,0 см',
  '108,0 - 115,2 см',
  '110,8 - 118,8 см',
  '113,9 - 122,0 см',
  '117,0 - 125,0 см',
  '122,0 - 131,0 см',
  '127,5 - 136,5 см',
  '133,0 - 142,0 см',
  '138,0 - 148,3 см',
  '142,7 - 154,9 см',
  '147,4 - 160,4 см',
  '152,4 - 166,4 см',
  '158,0 - 172,0 см',
  '162,2 - 177,4 см',
  '168,1 - 181,2 см'
];

// Рост (см), Девочки
var table_height_female = [
  '49,2 - 52,1 см',
  '52,4 - 55,3 см',
  '55,0 - 58,6 см',
  '57,9 - 61,5 см',
  '60,5 - 64,1 см',
  '62,8 - 66,4 см',
  '64,3 - 68,2 см',
  '66,4 - 70,0 см',
  '67,7 - 71,6 см',
  '69,3 - 72,8 см',
  '70,5 - 74,2 см',
  '71,7 - 75,7 см',
  '72,8 - 76,3 см',
  '75,2 - 78,8 см',
  '77,5 - 82,1 см',
  '80,0 - 84,6 см',
  '82,6 - 87,5 см',
  '85,4 - 90,1 см',
  '87,8 - 92,8 см',
  '90,3 - 95,5 см',
  '92,9 - 98,1 см',
  '95,6 - 101,0 см',
  '98,4 - 104,2 см',
  '101,5 - 107,1 см',
  '104,9 - 110,7 см',
  '108,0 - 114,5 см',
  '111,0 - 118,0 см',
  '114,0 - 121,7 см',
  '117,1 - 125,0 см',
  '123,0 - 131,0 см',
  '128,5 - 136,7 см',
  '133,8 - 142,5 см',
  '138,6 - 148,6 см',
  '143,0 - 155,1 см',
  '148,0 - 160,3 см',
  '152,4 - 164,2 см',
  '156,3 - 167,0 см',
  '158,3 - 169,0 см',
  '161,2 - 170,0 см'
];

// Вес (кг), Мальчики
var table_weight_male = [
  '3,0 - 3,7 кг',
  '3,8 - 4,5 кг',
  '4,6 - 5,5 кг',
  '5,4 - 6,4 кг',
  '6,2 - 7,2 кг',
  '6,8 - 7,9 кг',
  '7,4 - 8,6 кг',
  '7,9 - 9,1 кг',
  '8,4 - 9,6 кг',
  '8,9 - 10,1 кг',
  '9,2 - 10,6 кг',
  '9,5 - 11,0 кг',
  '9,8 - 11,5 кг',
  '10,5 - 12,2 кг',
  '11,0 - 12,8 кг',
  '11,5 - 13,5 кг',
  '12,0 - 14,1 кг',
  '12,4 - 14,6 кг',
  '12,8 - 15,1 кг',
  '13,2 - 15,6 кг',
  '13,6 - 16,0 кг',
  '14,2 - 17,0 кг',
  '15,1 - 18,0 кг',
  '15,9 - 19,0 кг',
  '16,8 - 20,1 кг',
  '17,8 - 21,4 кг',
  '18,9 - 22,6 кг',
  '20,0 - 24,0 кг',
  '21,3 - 25,5 кг',
  '23,4 - 28,4 кг',
  '25,6 - 31,4 кг',
  '28,0 - 35,1 кг',
  '31,0 - 39,2 кг',
  '34,4 - 43,8 кг',
  '39,8 - 49,0 кг',
  '42,2 - 54,6 кг',
  '46,9 - 60,2 кг',
  '51,8 - 65,9 кг',
  '56,8 - 70,6 кг'
];

// Вес (кг), Девочки
var table_weight_female = [
  '3,0 - 3,5 кг',
  '3,7 - 4,3 кг',
  '4,4 - 5,0 кг',
  '5,0 - 5,7 кг',
  '5,6 - 6,5 кг',
  '6,2 - 7,2 кг',
  '6,8 - 7,9 кг',
  '7,3 - 8,5 кг',
  '7,7 - 9,1 кг',
  '8,2 - 9,6 кг',
  '8,7 - 10,1 кг',
  '9,1 - 10,6 кг',
  '9,4 - 11,0 кг',
  '10,0 - 11,7 кг',
  '10,6 - 12,5 кг',
  '11,1 - 13,1 кг',
  '11,6 - 13,5 кг',
  '12,0 - 14,0 кг',
  '12,5 - 14,5 кг',
  '12,9 - 14,9 кг',
  '13,3 - 15,4 кг',
  '14,0 - 16,3 кг',
  '14,8 - 17,2 кг',
  '15,8 - 18,4 кг',
  '16,9 - 19,8 кг',
  '17,8 - 21,2 кг',
  '18,8 - 22,5 кг',
  '19,9 - 24,0 кг',
  '20,8 - 25,3 кг',
  '23,0 - 28,5 кг',
  '25,4 - 32,0 кг',
  '28,0 - 36,0 кг',
  '31,1 - 40,3 кг',
  '35,2 - 45,4 кг',
  '40,0 - 51,8 кг',
  '44,0 - 55,0 кг',
  '47,6 - 58,0 кг',
  '51,0 - 61,0 кг',
  '52,4 - 62,0 кг'
];

//==================================================================================
// Центильные интервалы показателей физических качеств
//==================================================================================
// 11 возр.групп, 7-17 лет
var ageRangeTablePhysicalAttributes = [
  84,96,108,120,132,144,156,168,180,192,204,240
];

var percentilesPhysicalAttributes = [
  '< 3%',
  '3-10%',
  '10-25%',
  '25-50%',
  '50-75%',
  '75-90%',
  '90-97%',
  '> 97%'
];

// Мышцы спины (сек), Мальчики
var table_back_strength_male = [
  [0, 7, 11, 21, 31, 50, 71, 85],
  [0, 10, 16, 26, 38, 51, 79, 122],
  [0, 15, 20, 30, 47.5, 63, 86, 118],
  [0, 12.3, 22, 35, 64, 84.5, 125, 155],
  [0, 19, 30, 45, 72, 102, 140, 180],
  [0, 19, 27, 60, 82.5, 123, 153.5, 187],
  [0, 22, 30, 46, 84.5,	117, 156.5, 190],
  [0, 14, 30, 52.4,	80, 110, 142, 201],
  [0, 17, 42, 64, 90, 121, 150, 181],
  [0, 35, 48, 59, 78, 110, 134, 158],
  [0, 30, 47, 63, 83, 116, 132, 172]
];
